-- Створення бази даних
CREATE DATABASE SHOP;
GO

-- Використання бази даних
USE SHOP;
GO

-- Створення таблиці SALES
CREATE TABLE SALES (
    SALES_ORDER_ID BIGINT,  -- Унікальний ідентифікатор замовлення
    REVISION_NUMBER TINYINT,  -- Інкремент для відстеження змін за замовленням
    ORDER_DATE DATETIME,  -- Дата і час створення замовлення
    DUE_DATE DATE,  -- Дата доставки замовлення
    SHIP_DATE DATE,  -- Фактична дата доставки замовлення
    ONLINE_ORDER_FLAG BIT,  -- 0 = замовлення менеджером, 1 = онлайн
    CUSTOMER_ID INT,  -- Унікальний ідентифікатор клієнта
    SALES_PERSON_ID INT,  -- Унікальний ідентифікатор співробітника
    TERRITORY_ID INT,  -- Унікальний ідентифікатор території
    SUB_TOTAL DECIMAL(18, 4),  -- Загальна сума замовлення
    TAX_AMT DECIMAL(10, 4),  -- Загальна сума податків
    FREIGHT DECIMAL(10, 4),  -- Сума доставки
    MODIFIED_DATE DATETIME  -- Дата і час останньої зміни рядка
);
GO

-- Вставка даних
INSERT INTO SALES (SALES_ORDER_ID, REVISION_NUMBER, ORDER_DATE, DUE_DATE, SHIP_DATE, ONLINE_ORDER_FLAG,
                   CUSTOMER_ID, SALES_PERSON_ID, TERRITORY_ID, SUB_TOTAL, TAX_AMT, FREIGHT, MODIFIED_DATE)
VALUES 
(43659, 11, '1753-01-01 00:00:00.000', '2011-06-12', '2011-06-07', 0, 29825, 279, 5, 184590.1346, 1971.5149, 616.0984, '2011-06-07 00:00:00.000'),
(43660,  8, '2011-05-31 00:00:00.000', '2011-06-12', '2011-06-07', 0, 29672, 279, 5, 1294.2529,  124.2483,  38.8276,  '2011-06-07 00:00:00.000'),
(43661,  8, '2011-05-31 00:00:00.000', '2011-06-12', '2011-06-07', 0, 29734, 282, 6, 32726.4786,  3153.7696, 985.553,  '2011-06-07 00:00:00.000'),
(43662,  8, '2011-05-31 00:00:00.000', '2011-06-12', '2011-06-07', 0, 29994, 282, 6, 28832.5289,  2775.1646, 867.2389, '2011-06-07 00:00:00.000'),
(43663,  8, '2011-05-31 00:00:00.000', '2011-06-12', '2011-06-07', 0, 29565, 276, 4,  419.4589,    40.2681,  12.5838,  '2011-06-07 00:00:00.000');
GO

-- Вибірка даних
SELECT * FROM SALES;
GO

-- Видалення таблиці
DROP TABLE SALES;
GO

-- Видалення бази даних
USE master;
GO
DROP DATABASE SHOP;
GO

