
-- Задача 1. Запит для отримання списку унікальних ідентифікаторів виробників, де сума замовлення парна, а кількість одиниць товару непарна: --
SELECT DISTINCT MFR
FROM dbo.ORDERS
WHERE CAST(AMOUNT AS INT) % 2 = 0    -- Перевірка парності суми замовлення
  AND QTY % 2 <> 0                   -- Перевірка непарності кількості одиниць товару
ORDER BY MFR;

-- Задача 2. Запит для отримання загальної вартості одиниць товару на складі та середньої вартості одиниць товарів для кожного виробника --
SELECT MFR,
       ROUND(SUM(QTY * AMOUNT), 2) AS total_value,   -- Загальна вартість товарів на складі
       ROUND(AVG(AMOUNT), 2) AS avg_value            -- Середня вартість товару
FROM dbo.ORDERS
GROUP BY MFR
ORDER BY MFR;

-- Задача 3. Запит для знаходження працівника з найбільшою абсолютною різницею між ціллю по продажах і фактичними продажами. --
SELECT TOP 1
       EMPL_NUM,  -- Ідентифікатор працівника
       NAME,      -- Ім'я працівника
       ABS(QUOTA - SALES) AS sales_diff,  -- Абсолютна різниця між цільовими продажами та фактичними продажами
       ROUND(DATEDIFF(YEAR, HIRE_DATE, GETDATE()), 2) AS years_at_company  -- Розрахунок кількості років на компанії
FROM dbo.SALESREPS
ORDER BY sales_diff DESC;