-- Задача 1. Запит для отримання списку унікальних ідентифікаторів виробників, де сума замовлення парна, а кількість одиниць товару непарна: --
SELECT DISTINCT MFR
FROM [dbo].[ORDERS]
WHERE AMOUNT % 2 = 0  -- Умова, що сума замовлення (AMOUNT) є парним числом
  AND QTY % 2 = 1     -- Умова, що кількість одиниць товару (QTY) є непарним числом
ORDER BY MFR;         -- Сортування результату за ідентифікатором виробника (MFR)

-- Задача 2. Запит для отримання загальної вартості одиниць товару на складі та середньої вартості одиниць товарів для кожного виробника --
SELECT 
    MFR_ID,                                    -- Ідентифікатор виробника
    ROUND(SUM(QTY_ON_HAND * PRICE), 2) AS total_value,  -- Загальна вартість товарів виробника
    ROUND(AVG(PRICE), 2) AS average_price             -- Середня ціна товару виробника
FROM [dbo].[PRODUCTS]
GROUP BY MFR_ID                              -- Групування за виробниками
ORDER BY MFR_ID;                             -- Сортування за ідентифікатором виробника

-- Задача 3. Запит для знаходження працівника з найбільшою абсолютною різницею між ціллю по продажах і фактичними продажами. --
SELECT 
    EMPL_NUM,                                -- Ідентифікатор працівника
    NAME,                                    -- Ім'я працівника
    ROUND(ABS(SALES - QUOTA), 2) AS abs_difference,  -- Абсолютна різниця між фактичними продажами та ціллю
    DATEDIFF(YEAR, HIRE_DATE, GETDATE()) AS years_at_hire  -- Кількість років з моменту найму
FROM [dbo].[SALESREPS]
WHERE ABS(QUOTA - SALES) = (                -- Фільтрація записів із максимальною абсолютною різницею
    SELECT MAX(ABS(QUOTA - SALES))          -- Підзапит для пошуку максимальної різниці
    FROM [dbo].[SALESREPS]
)
ORDER BY EMPL_NUM;                          -- Сортування за ідентифікатором працівника

